[
    {
        "company": "Arm",
        "title": "Software Engineer",
        "duration": "Jan 2025 - Present",
        "description": [
            "Working as a Software Engineer in the Arm ATG group under Methodology team",
            "Owning and driving the implementation of coverage report tooling and infrastructure",
            "Optimized multiple processes for I/O performance and efficiency, reducing overall compute time from 4 hours to 20 minutes (an 90% improvement)",
            "Collaborating with cross-functional teams to gather requirements and deliver impactful solutions"
        ]
    },
    {
        "company": "Sandvine Technologies",
        "title": "Software Engineer 2",
        "duration": "Jan 2023 - Jan 2025",
        "description": [
            "Worked as a Software Engineer in the Data Plane team.",
            "Contributed to designing scalable infrastructure for pseudo-inline Deep Learning model integration with DPDK packet processing, boosting application classification accuracy by ~30%.",
            "Integrated XNNPackdelegate into code flow, enhancing avg. inference time by 66%, reducing latency from 9μs to 3μs.",
            "Developed the solution/POC for the new feature in the product to classfy the Xbox/PS game download traffic and successfully classifying the top games with 95+% accuracy.",
            "Worked on multiple customer commitments with hard deadlines and successfully delivered the solution on time."
        ]
    },
    {
        "company" :"Data Peace.Pvt.Ltd (Upai.io)",
        "title" : "Software Engineer",
        "duration" : "Jume 2021 - August 2021",
        "description" : 
        [
            "Worked as a Software Developer intern with the backend team, ",
            "Primarily using Python, but also Node JS.",
            "Using FastAPI, Fastify and Flask as framework and PostgreSQL, SQLite as database, also ",
            "Developed plugins on serverless architecture (AWS lambda)."
        ]
        
    },
    {
        "company" : "Eyudh",
        "title" : "Startup Project",
        "duration" : "May 2021 - August 2021",
        "description" : 
        [
            "Manage Deployment on AWS ec2 using Nginx for reverse Proxy",
            "Docker for deployment, CertBot for SSL certificate managment.",
            "Implemented Transaction for database API requests.",
            "Using Node.js and Mongodb as base Tech stack"
        ]
    }
]